DeviceProcessEvents
| where Timestamp >= ago(14d)
| where FileName in ("net.exe","net1.exe")
      and ProcessCommandLine hasregex @"(?i)net user /domain"
| project Timestamp, DeviceName, InitiatingProcessAccountName, ProcessCommandLine
