AuditLogs
| where OperationName == "Add app registration"
| summarize count() by InitiatedBy.user.userPrincipalName, bin(TimeGenerated, 7d)
| where count_ > 0
| project TimeGenerated, Initiator=InitiatedBy.user.userPrincipalName, AppName=tostring(TargetResources[0].displayName)
