DeviceFileEvents
| where Timestamp >= ago(1d)
| where FolderPath contains "\\Users\\" 
      and (FileName endswith ".locked" or FileName endswith ".encrypted" or FileName endswith ".crypt")
| summarize count() by DeviceName, FolderPath
| where count_ > 20
