DeviceNetworkEvents
| where Timestamp >= ago(1d)
| where InitiatingProcessFileName in ("ping.exe","tracert.exe")
| where RemoteIPType == "Internal"
| summarize count() by DeviceName, InitiatingProcessAccountName, bin(Timestamp, 1h)
| where count_ > 10
