DeviceProcessEvents
| where Timestamp >= ago(14d)
| where FileName in ("word.exe","excel.exe","acrobat.exe","OneNote.exe")
      and ProcessCommandLine contains "SharePoint" 
| project Timestamp, DeviceName, InitiatingProcessAccountName, ProcessCommandLine
