CommonSecurityLog
| where DestinationIP in (ThreatIntelligenceIndicator | where Description contains "Tor Exit" | distinct NetworkIP) 
| project TimeGenerated, SourceIP, DestinationIP, DestinationPort
