DeviceProcessEvents
| where Timestamp >= ago(14d)
| where InitiatingProcessFileName in ("wmic.exe","wmiprvse.exe")
      and ProcessCommandLine has_any ("call create", "EXECUTE")
| project Timestamp, DeviceName, InitiatingProcessAccountName, ProcessCommandLine
 